---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinition.HasResolutions
source: html/7a319f17-3a12-69b1-a2b9-7d59f8550189.htm
---
# Autodesk.Revit.DB.FailureDefinition.HasResolutions Method

Checks if the FailureDefinition has at least one resolution.

## Syntax (C#)
```csharp
public bool HasResolutions()
```

## Returns
True if at least one resolution is defined in the FailureDefinition.